from transformers import pipeline

model_name = "./model"
token='./tokenizer'
nlp = pipeline("question-answering", model=model_name, tokenizer=token)
   



context ="جرم حرارتی هر ماده ای است که می تواند برای ذخیره گرما - گرمای خورشید از انرژی خورشیدی استفاده شود. مواد معمول جرم حرارتی شامل سنگ ، سیمان و آب است. از نظر تاریخی در آب و هوای خشک یا مناطق معتدل گرم برای خنک نگه داشتن ساختمان ها با جذب انرژی خورشید در طول روز و تابش گرمای ذخیره شده به فضای خنک تر در شب استفاده می شده است. با این حال ، می توان از آنها در مناطق معتدل سرد برای حفظ گرما نیز استفاده کرد. اندازه و محل قرارگیری توده حرارتی به عوامل مختلفی از جمله آب و هوا ، نور روز و شرایط سایه بستگی دارد. اگر جرم حرارتی به درستی ترکیب شود ، دمای فضا را در یک محدوده راحت حفظ می کند و نیاز به تجهیزات سرمایشی و گرمایشی را کاهش می دهد."
question = "چگونه برای خنک نگه داشتن ساختمان ها از جرم حرارتی استفاده می شود؟"
   
result = nlp(question=question, context=context)
print(result)
   
